In [1]:
import pandas as pd

employees = {'Name of Employee': ['Jon','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill'],
             'Sales': [1000,300,400,500,800,1000,500,700,50,60,1000,900,750,200,300,1000,900,250,750,50],
             'Quarter': [1,1,1,1,1,2,2,2,2,2,3,3,3,3,3,4,4,4,4,4],
             'Country': ['US','Japan','Brazil','UK','US','Brazil','Japan','Brazil','US','US','US','Japan','Brazil','UK','Brazil','Japan','Japan','Brazil','UK','US']
            }

df = pd.DataFrame(employees, columns= ['Name of Employee','Sales','Quarter','Country'])

print (df)

   Name of Employee  Sales  Quarter Country
0               Jon   1000        1      US
1              Mark    300        1   Japan
2              Tina    400        1  Brazil
3             Maria    500        1      UK
4              Bill    800        1      US
5               Jon   1000        2  Brazil
6              Mark    500        2   Japan
7              Tina    700        2  Brazil
8             Maria     50        2      US
9              Bill     60        2      US
10              Jon   1000        3      US
11             Mark    900        3   Japan
12             Tina    750        3  Brazil
13            Maria    200        3      UK
14             Bill    300        3  Brazil
15              Jon   1000        4   Japan
16             Mark    900        4   Japan
17             Tina    250        4  Brazil
18            Maria    750        4      UK
19             Bill     50        4      US

In [3]:
#Total sales per employee
pd.pivot_table(df, index=["Name of Employee"], values=["Sales"], aggfunc="sum")

                  Sales
Name of Employee
Bill               1210
Jon                4000
Maria              1500
Mark               2600
Tina               2100

In [4]:
#Total sales by country
pd.pivot_table(df, index=["Country"], values=["Sales"], aggfunc="sum")

         Sales
Country
Brazil    3400
Japan     3600
UK        1450
US        2960

In [5]:
#Sales by both employee and country
pd.pivot_table(df, index=["Country", "Name of Employee"], values=["Sales"], aggfunc="sum")

                          Sales
Country Name of Employee
Brazil  Bill                300
        Jon                1000
        Tina               2100
Japan   Jon                1000
        Mark               2600
UK      Maria              1450
US      Bill                910
        Jon                2000
        Maria                50

In [6]:
#Maximum individual sale by country
pd.pivot_table(df, index=["Country"], values=["Sales"], aggfunc="max")

         Sales
Country
Brazil    1000
Japan     1000
UK         750
US        1000

In [8]:
#Mean, median and minimum sales by country
pd.pivot_table(df, index=["Country"], values=["Sales"], aggfunc={"mean", "median", "min"})

              Sales
               mean median    min
Country
Brazil   566.666667  550.0  250.0
Japan    720.000000  900.0  300.0
UK       483.333333  500.0  200.0
US       493.333333  430.0   50.0